{
  "Projects": [
    {
      "show": true,
      "title": "Multi-Tenant SaaS Platform for Business Websites",
      "desc": [
        "Developed a scalable multi-tenant SaaS platform that enables clients to create and manage their own business websites seamlessly. Each client can register their business, add user details, and instantly generate a dedicated subdomain for their site.",
        "Upon purchasing a custom domain, Nginx reverse proxy is configured to map the subdomain to the client's main domain dynamically. Designed and implemented a fully customizable client dashboard that adapts based on the client's business type, allowing them to manage their entire site — including components, pages, products, categories, customer bookings, and content — without developer assistance.",
        "Integrated Google Cloud Storage (GCS) for secure and scalable image and file uploads, ensuring optimal performance and reliability. Built robust authentication and user management for clients and their team members, supporting role-based access controls."
      ],
      "year": "2025",
      "preview": "",
      "code": "",
      "thumbnail": "/image/projects/gethubservice.png",
      "images": [
        "/image/projects/gethubservice.png",
        "/image/projects/gethubservice1.png",
        "/image/projects/gethubservice2.png",
        "/image/projects/gethubservice3.png"
      ],
      "tech": [
        "Next.js",
        "Node.js",
        "Express.js",
        "MongoDB",
        "Tailwind CSS",
        "Google Cloud",
        "Nginx"
      ], 
      "slug": "saas-platform",
      "category": [1]
    },
    {
      "show": true,
      "title": "Japanese Tutor Finder Website",
      "desc": [
        "Designed and developed a fully responsive web application for students to find and connect with qualified Japanese language tutors, using advanced search filters such as location, availability, and teaching experience.",
        "Implemented dynamic tutor profiles with detailed information, including bio, expertise, pricing, and availability, using React components and integrated seamless navigation with React Router. Created interactive forms for students to send inquiries or contact tutors directly, leveraging React's state management for smooth and real-time user input handling.",
        "Built a secure admin panel to manage tutor registrations, student inquiries, and content updates, with role-based access controls and CRUD operations using Express.js and MongoDB. Optimized site performance through lazy loading, code splitting, and efficient data fetching, ensuring a fast, responsive user experience across devices."
      ],
      "year": "2025",
      "preview": "",
      "code": "",
      "thumbnail": "/image/projects/japanese.png",
      "images": [
        "/image/projects/japanese.png",
        "/image/projects/japanese1.png",
        "/image/projects/japanese2.png",
        "/image/projects/japanese3.png",
        "/image/projects/japanese4.png"
      ],
      "tech": [
        "React.js",
        "Node.js",
        "Express.js",
        "MongoDB",
        "CSS",
        "React Router"
      ], 
      "slug": "japanese-tutor-finder",
      "category": [1]
    },
    {
      "show": true,
      "title": "TITA Technology Company Website",
      "desc": [
        "Developed a fully responsive company website using React.js for TITA Technologies, showcasing the company's services, portfolio, and team information. The website features modern design principles and smooth user interactions.",
        "Integrated dynamic content rendering with reusable React components for efficient user interactions. Implemented secure API endpoints with Node.js and Express.js for data handling and communication. Managed data operations with MongoDB to ensure fast and reliable data storage.",
        "Utilized React Router for seamless page navigation and user experience. Optimized website performance through code splitting and lazy loading techniques. Conducted thorough debugging and testing to ensure high-quality user experience across all devices and browsers."
      ],
      "year": "2024",
      "preview": "",
      "code": "",
      "thumbnail": "/image/projects/tita.png",
      "images": [
        "/image/projects/tita.png",
        "/image/projects/tita1.png",
        "/image/projects/tita2.png",
        "/image/projects/tita3.png"
      ],
      "tech": [
        "React.js",
        "Node.js",
        "Express.js",
        "MongoDB",
        "CSS",
        "React Router"
      ], 
      "slug": "tita-technology-website",
      "category": [1]
    },
    {
      "show": true,
      "title": "Daily Tuition Website",
      "desc": [
        "Created a responsive educational platform with interactive content delivery using React.js. The platform enables students to access learning materials, schedule tutoring sessions, and track their academic progress in a user-friendly interface.",
        "Implemented secure backend API endpoints for user data management using Node.js and Express.js. Designed user-friendly interfaces for enhanced user engagement, making it easy for both students and tutors to navigate the platform.",
        "Managed content storage and user records with MongoDB, ensuring data integrity and fast retrieval. Ensured smooth navigation with React Router and optimized performance using best practices including code splitting, lazy loading, and efficient state management."
      ],
      "year": "2024",
      "preview": "",
      "code": "",
      "thumbnail": "/image/projects/dailytuition.png",
      "images": [
        "/image/projects/dailytuition.png",
        "/image/projects/dailytuition1.png",
        "/image/projects/dailytuition2.png",
        "/image/projects/dailytuition3.png",
        "/image/projects/dailytuition4.png"
      ],
      "tech": [
        "React.js",
        "Node.js",
        "Express.js",
        "MongoDB",
        "CSS",
        "React Router"
      ], 
      "slug": "daily-tuition-website",
      "category": [1]
    }
  ]
}
